# Libs

In [23]:
import pandas as pd
import streamlit as st
import pandas as pd
import re

# Leitura da base crua

In [26]:
# Carregar arquivo Excel
# arquivo = "./Fatura-Excel.xls"  # Substitua pelo nome do seu arquivo
arquivo = r"C:\Users\feh_s\Desktop\Faturas\2025\Fatura-Excel-202506.xls"  # Substitua pelo nome do seu arquivo

df = pd.read_excel(
    arquivo
    # , engine='openpyxl'
)
df.head()

  Logotipo Itaú               Unnamed: 1 Unnamed: 2 Unnamed: 3
0  Atualização:   12/07/2025 às 19:03:21        NaN        NaN
1         Nome:  FELIPE BATISTA DE SOUZA        NaN        NaN
2      Agência:                     6369        NaN        NaN
3        Conta:                  28614-8        NaN        NaN
4           NaN                      NaN        NaN        NaN

# Função completa

In [21]:
#!/usr/bin/env python
# coding: utf-8

# # Libs
import pandas as pd
import streamlit as st
import re

# Função REGEX
def limparNmGasto(col):
    # Se terminar com caracteres não alfabéticos, remove-os do final
    return re.sub(r'[^a-zA-ZÀ-ÿ\s]+$', '', col)

#Função principal de limpeza dos dados
def LimpaDados(df):
        df.drop(columns='Unnamed: 2', inplace=True)




        # ## Renomeia colunas
        NomesColunas = {
            0:'Data'
            , 1: 'NmGasto'
            , 2: 'Valor'
        }

        df.columns = [NomesColunas[i] if i in NomesColunas else df.columns[i] for i in range(len(df.columns))]
        df.head()


        # ## Retirando NaN
        df_SemNulo = df[(~df['Valor'].isnull()) & (~df['Data'].isnull())].reset_index(drop=True)

        df_SemNulo[df_SemNulo['Valor'].isnull()]

        # ## Selecionando os valores verdadeiros

        # ## Limpa data

        # Expressão regular para encontrar datas no formato dd/mm/yyyy
        padrao_data = r"^\d{2}/\d{2}/\d{4}$"

        # Filtrar linhas com datas no formato certo
        filtro = df_SemNulo["Data"].astype(str).str.match(padrao_data)
        df_Union = df_SemNulo[filtro].reset_index(drop=True)

        # Aplica a função à coluna
        df_Union['NmGasto'] = df_Union['NmGasto'].apply(limparNmGasto)


        return df_Union

In [22]:
df_limpo = LimpaDados(df)
df_limpo

          Data                 NmGasto   Valor
0   10/02/2025                Dm*udemy    24.9
1   01/02/2025              Google One    79.9
2   02/02/2025    Google Myworkoutplan   16.99
3   16/02/2025   Google 365scores Live    7.97
4   13/01/2025      Amazon Marketplace   86.98
5   13/01/2025      Amazon Marketplace   -0.02
6   27/01/2025  Ifd*esquina Grill E Pi      77
7   28/01/2025      Shopee *aopharmace  192.46
8   29/01/2025      Amazon Marketplace  169.81
9   31/01/2025                    Petz  273.67
10  01/02/2025          Mp *aliexpress   163.9
11  01/02/2025  Ifd*mimic Fornecimento   60.99
12  04/02/2025      Msaquecedores          560
13  06/02/2025              Dm*spotify    27.9
14  06/02/2025             Disney Plus    62.9
15  06/02/2025      Rdsaude Online      178.87
16  08/02/2025      99app       *99app   29.57
17  09/02/2025      99app       *99app   36.54
18  09/02/2025      99app       *99app      32
19  09/02/2025      99app       *99app    51.6
20  09/02/2025   Ifood  *ifd*heranca C  129.61
21  11/02/2025      Pg *nuvem Bixocafe  104.88
22  12/02/2025         Pet Supremo -ct     159
23  13/02/2025  Evoqueacademiaavriobra   149.9
24  15/02/2025   Comercial De-ct Os Sp   20.25
25  15/02/2025  Armazem Santa Filomena  334.16
26  17/02/2025         Pb*um Coffee Co   95.18
27  22/02/2025   Ifood  *ifd*pedro Tom  127.99
28  23/02/2025       Google Scribd Inc   27.99

# Limpeza dos dados

## Drop colunas

In [4]:
df.drop(columns='Unnamed: 2', inplace=True)
df.head()

  Logotipo Itaú               Unnamed: 1 Unnamed: 3
0  Atualização:   26/02/2025 às 11:27:00        NaN
1         Nome:  FELIPE BATISTA DE SOUZA        NaN
2      Agência:                     6369        NaN
3        Conta:                  28614-8        NaN
4           NaN                      NaN        NaN

## Renomeia colunas

In [5]:
NomesColunas = {
    0:'Data'
    , 1: 'NmGasto'
    , 2: 'Valor'
}

df.columns = [NomesColunas[i] if i in NomesColunas else df.columns[i] for i in range(len(df.columns))]
df.head()

           Data                  NmGasto Valor
0  Atualização:   26/02/2025 às 11:27:00   NaN
1         Nome:  FELIPE BATISTA DE SOUZA   NaN
2      Agência:                     6369   NaN
3        Conta:                  28614-8   NaN
4           NaN                      NaN   NaN

## Retirando NaN

In [6]:
df_SemNulo = df[(~df['Valor'].isnull()) & (~df['Data'].isnull())].reset_index(drop=True)

In [7]:
df_SemNulo[df_SemNulo['Valor'].isnull()]

Empty DataFrame
Columns: [Data, NmGasto, Valor]
Index: []

## Selecionando os valores verdadeiros

## Limpa data

In [13]:
# Expressão regular para encontrar datas no formato dd/mm/yyyy
padrao_data = r"^\d{2}/\d{2}/\d{4}$"

# Filtrar linhas com datas no formato certo
filtro = df_SemNulo["Data"].astype(str).str.match(padrao_data)
df_Union = df_SemNulo[filtro].reset_index(drop=True)

df_Union.head()

         Data                  NmGasto  Valor
0  10/02/2025                 Dm*udemy   24.9
1  01/02/2025               Google One   79.9
2  02/02/2025     Google Myworkoutplan  16.99
3  16/02/2025    Google 365scores Live   7.97
4  13/01/2025  Amazon Marketplace02/03  86.98

In [ ]:
# valorAlvo = 'data'
# colunaAlvo = "Data"
# indice1 = df_SemNulo[df_SemNulo["Data"] == valorAlvo].index[0]
# indice2 = df_SemNulo[df_SemNulo["Data"] == valorAlvo].index[1]


# # Filtrar o DataFrame a partir dessa linha
# df_data1 = df_SemNulo.iloc[indice1+1:indice2-1]
# df_data2 = df_SemNulo.iloc[indice2+1:]

# # Une os 2 dataframes
# df_Union = pd.concat([df_data1, df_data2], ignore_index=True)
# df_Union.head()

,Data,NmGasto,Valor
0,10/02/2025,Dm*udemy,24.9
1,01/02/2025,Google One,79.9
2,02/02/2025,Google Myworkoutplan,16.99
3,16/02/2025,Google 365scores Live,7.97
4,total nacional do cartão - final 0887 (adicional),NaN,104.86

## Retira total

In [ ]:
# NovoIndice = df_Union[df_Union[colunaAlvo].str.startswith('total nacional do cartão')].index[0]
# NovoIndice

IndexError: index 0 is out of bounds for axis 0 with size 0

In [ ]:
# df_STotal = df_Union.iloc[:NovoIndice]

In [15]:
df_Union['Valor'].sum()

3282.89

## Tirar número dos nomes

In [12]:
def limparNmGasto(col):
    # Se terminar com caracteres não alfabéticos, remove-os do final
    return re.sub(r'[^a-zA-ZÀ-ÿ\s]+$', '', col)

# Aplica a função à coluna
df_limpo['NmGasto'] = df_limpo['NmGasto'].apply(limparNmGasto)

In [19]:
df_limpo.loc[df_limpo['NmGasto'].str.contains('res')]

          Data                NmGasto  Valor
3   16/02/2025  Google 365scores Live   7.97
10  01/02/2025         Mp *aliexpress  163.9
12  04/02/2025     Msaquecedores         560

# Check base

In [12]:
df_STotal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Data     4 non-null      object
 1   NmGasto  4 non-null      object
 2   Valor    4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

In [19]:
df_STotal.describe()

              Data             NmGasto  Valor
count           33                  33   33.0
unique          22                  28   32.0
top     06/05/2025  99app       *99app   26.4
freq             4                   5    2.0

In [23]:
df_STotal.Valor.sum()

3122.34